Repository: lingxi-coder/lingxi-app
Catalog: clients/ios/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, ko, zh_hant

# drawer_search_placeholder
source: 搜索会话、项目、定时任务或应用
en: Search chats, projects, cron tasks, or apps
ja: 会話・プロジェクト・定時タスク・アプリを検索
ko: 대화, 프로젝트, 예약 작업 또는 앱 검색
zh_hant: 搜尋會話、專案、定時任務或應用

# drawer_session_meta
source: %1$s · %2$d 条
en: %1$s · %2$d messages
ja: %1$s · %2$d 件
ko: %1$s · %2$d개
zh_hant: %1$s · %2$d 條

# drawer_session_subtitle %@ %lld
source: %@ · %lld 条
en: %@ · %lld messages
ja: %@ · %lld 件
ko: %@ · %lld개
zh_hant: %@ · %lld 條

# drawer_sessions_load_failed
source: 会话列表加载失败
en: Failed to load session list
ja: 会話一覧の読み込みに失敗しました
ko: 대화 목록 로드 실패
zh_hant: 會話列表載入失敗

# drawer_sessions_loading
source: 正在加载会话…
en: Loading sessions…
ja: 会話を読み込んでいます…
ko: 대화를 불러오는 중…
zh_hant: 正在載入會話…

# drawer_tab_apps
source: 应用
en: Apps
ja: アプリ
ko: 앱
zh_hant: 應用

# drawer_tab_chats
source: 对话
en: Chats
ja: 会話
ko: 대화
zh_hant: 對話

# drawer_tab_crons
source: 定时
en: Cron
ja: 定時
ko: 예약
zh_hant: 定時

# drawer_tab_projects
source: 项目
en: Projects
ja: プロジェクト
ko: 프로젝트
zh_hant: 專案

# drawer_workspace_saved_note
source: 工作区会保存在 App 管理目录中。
en: The workspace is saved in the app's managed directory.
ja: ワークスペースはアプリの管理ディレクトリに保存されます。
ko: 작업 공간은 앱 관리 디렉터리에 저장됩니다.
zh_hant: 工作區會儲存在 App 管理目錄中。

# drawer_workspaces_unavailable
source: 工作区数据源尚未接入
en: Workspace data source not yet connected
ja: ワークスペースのデータソースはまだ接続されていません
ko: 작업 공간 데이터 소스가 아직 연결되지 않았습니다
zh_hant: 工作區資料來源尚未接入

# dream_activities_footer
source: 可叠加，越多越费电与算力。
en: These can be combined — the more active, the more battery and compute they use.
ja: 複数選択できますが、多いほどバッテリーと処理性能を消費します。
ko: 여러 개를 함께 켤 수 있으며, 많을수록 배터리와 연산 자원을 더 사용합니다.
zh_hant: 可疊加，越多越費電與算力。

# dream_activity_plan
source: 草拟今日计划
en: Draft Today's Plan
ja: 今日の計画を下書き
ko: 오늘 계획 초안 작성
zh_hant: 草擬今日計畫

# dream_activity_plan_sub
source: 基于昨日未完成 + 日历
en: Based on yesterday's leftovers + your calendar
ja: 昨日の未完了タスクとカレンダーに基づく
ko: 어제 미완료 항목 + 캘린더 기반
zh_hant: 基於昨日未完成 + 日曆

# dream_activity_polish
source: 润色草稿
en: Polish Drafts
ja: 下書きを推敲
ko: 초안 다듬기
zh_hant: 潤色草稿

# dream_activity_polish_sub
source: 为待发邮件/文档生成 2 套候选
en: Generates 2 options for pending emails/documents
ja: 未送信のメールや文書に対して候補を 2 案生成
ko: 발송 대기 중인 이메일/문서에 대해 후보안 2가지 생성
zh_hant: 為待發郵件/文件生成 2 套候選

# dream_activity_prefetch
source: 预热常用上下文
en: Prefetch Common Context
ja: よく使うコンテキストを事前読み込み
ko: 자주 쓰는 컨텍스트 미리 준비
zh_hant: 預熱常用上下文

# dream_activity_prefetch_sub
source: 预生成你最常问的回答
en: Pre-generates answers to your most frequent questions
ja: よく聞かれる質問への回答を事前生成
ko: 자주 묻는 답변을 미리 생성해 둡니다
zh_hant: 預生成你最常問的回答

# dream_activity_recap
source: 总结过去一周
en: Recap the Past Week
ja: 過去 1 週間を振り返る
ko: 지난 한 주 요약
zh_hant: 總結過去一週

# dream_activity_recap_sub
source: 每周日凌晨生成回顾报告
en: Generates a recap every Sunday, early morning
ja: 毎週日曜の未明にレビューレポートを生成
ko: 매주 일요일 새벽에 회고 보고서 생성
zh_hant: 每週日凌晨生成回顧報告

# dream_activity_reorganize
source: 整理记忆
en: Organize Memory
ja: 記憶を整理
ko: 기억 정리
zh_hant: 整理記憶

# dream_activity_reorganize_sub
source: 合并相似 / 去重 / 归档过期
en: Merge similar items, remove duplicates, archive what's outdated
ja: 類似項目の統合／重複除去／期限切れの整理
ko: 유사 항목 병합 / 중복 제거 / 만료 항목 보관
zh_hant: 合併相似 / 去重 / 歸檔過期

# dream_budget_high
source: 高
en: High
ko: 높음

# dream_budget_high_sub
source: 推理模型 + 工具 · 最深入
en: Reasoning models + tools · most thorough
ja: 推論モデル + ツール・最も高度
ko: 추론 모델 + 도구 사용 · 가장 심층적

# dream_budget_low
source: 低
en: Low
ko: 낮음

# dream_budget_low_sub
source: 本地模型为主 · 几乎免费
en: Mostly local models · nearly free
ja: ローカルモデル中心・ほぼ無料
ko: 로컬 모델 위주 · 거의 무료
zh_hant: 本地模型為主 · 幾乎免費

# dream_budget_medium
source: 中
en: Medium
ko: 중간

# dream_budget_medium_sub
source: 中等模型 · 默认
en: Mid-tier models · default
ja: 中位モデル・デフォルト
ko: 중간 모델 · 기본값
zh_hant: 中等模型 · 預設

# dream_compute_budget_footer
source: 高预算会优先调用更强模型（如 Claude Opus），并访问 MCP 工具。低预算只用本地 + 最便宜模型。
en: A higher budget prioritizes stronger models (like Claude Opus) and MCP tool access. A lower budget sticks to local and the cheapest models.
ja: 予算を高くすると、より高性能なモデル（Claude Opus など）や MCP ツールを優先的に利用します。予算が低い場合はローカルモデルと最も安価なモデルのみを使用します。
ko: 예산이 높을수록 더 강력한 모델(예: Claude Opus)을 우선 사용하고 MCP 도구에 접근합니다. 예산이 낮으면 로컬 모델과 가장 저렴한 모델만 사용합니다.
zh_hant: 高預算會優先呼叫更強模型（如 Claude Opus），並存取 MCP 工具。低預算只用本地 + 最便宜模型。

# dream_conditions_footer
source: 确保不会影响日常使用：仅在充电 + Wi-Fi 时跑昂贵任务。
en: Keeps everyday use unaffected — expensive tasks only run while charging and on Wi-Fi.
ja: 日常利用の妨げにならないよう、負荷の高いタスクは充電中かつ Wi-Fi 接続時のみ実行します。
ko: 일상 사용에 영향이 없도록: 충전 중 + Wi-Fi 연결 시에만 비용이 큰 작업을 실행합니다.
zh_hant: 確保不會影響日常使用：僅在充電 + Wi-Fi 時跑昂貴任務。

# dream_description_blurb
source: 当设备闲置时，灵犀在后台运行 整理、规划、润色 — 醒来即可看到结果
en: While your device is idle, Lingxi works in the background organizing, planning, and polishing — see the results when you wake up
ja: デバイスがアイドル状態のとき、灵犀はバックグラウンドで動作します 整理・計画・推敲 — 起きたときには結果が届いています
ko: 기기가 유휴 상태일 때 灵犀가 백그라운드에서 정리, 계획, 다듬기를 수행합니다 — 깨어나면 결과를 바로 확인할 수 있습니다
zh_hant: 當裝置閒置時，靈犀在背景執行 整理、規劃、潤色 — 醒來即可看到結果

# dream_enable
source: 开启 Dream 模式
en: Turn On Dream Mode
ja: Dream モードをオンにする
ko: Dream 모드 켜기
zh_hant: 開啟 Dream 模式

# dream_only_charging
source: 仅在充电时
en: Only While Charging
ja: 充電中のみ
ko: 충전 중일 때만
zh_hant: 僅在充電時

# dream_only_wifi
source: 仅在 Wi-Fi 时
en: Only on Wi-Fi
ja: Wi-Fi 接続時のみ
ko: Wi-Fi 연결 시만
zh_hant: 僅在 Wi-Fi 時

# dream_recap_item_1
source: 03:24 - 03:41 · 整理记忆
en: 03:24 - 03:41 · Organized memory
ja: 03:24 - 03:41 · 記憶の整理
ko: 03:24 - 03:41 · 기억 정리
zh_hant: 03:24 - 03:41 · 整理記憶

# dream_recap_item_2
source: 03:41 - 04:02 · 草拟今日计划
en: 03:41 - 04:02 · Drafted today's plan
ja: 03:41 - 04:02 · 今日の計画を下書き
ko: 03:41 - 04:02 · 오늘 계획 초안 작성
zh_hant: 03:41 - 04:02 · 草擬今日計畫

# dream_recap_item_3
source: 04:02 - 04:08 · 润色邮件
en: 04:02 - 04:08 · Polished emails
ja: 04:02 - 04:08 · メールを推敲
ko: 04:02 - 04:08 · 이메일 다듬기
zh_hant: 04:02 - 04:08 · 潤色郵件

# dream_recap_sub_1
source: 合并 12 条 → 7 条，归档 5 条过期
en: Merged 12 items into 7, archived 5 as outdated
ja: 12 件を 7 件に統合、期限切れ 5 件をアーカイブ
ko: 12개를 7개로 병합, 만료된 5개 보관
zh_hant: 合併 12 條 → 7 條，歸檔 5 條過期

# dream_recap_sub_2
source: 基于 8 个未完成事项 + 3 场会议
en: Based on 8 open tasks + 3 meetings
ja: 未完了タスク 8 件と会議 3 件に基づく
ko: 미완료 항목 8개 + 회의 3건 기반
zh_hant: 基於 8 個未完成事項 + 3 場會議

# dream_recap_sub_3
source: 为 2 封草稿各生成 1 套候选
en: Generated 1 option each for 2 drafts
ja: 下書き 2 件に対しそれぞれ 1 案を生成
ko: 초안 2건 각각 후보안 1개씩 생성
zh_hant: 為 2 封草稿各生成 1 套候選

# dream_section_activities
source: 允许的活动
en: Allowed Activities
ja: 許可する動作
ko: 허용된 활동
zh_hant: 允許的活動

# dream_section_compute_budget
source: 算力预算
en: Compute Budget
ja: コンピューティング予算
ko: 연산 예산
zh_hant: 算力預算

# dream_section_conditions
source: 运行条件
en: Run Conditions
ja: 実行条件
ko: 실행 조건
zh_hant: 執行條件

# dream_section_last_night
source: 昨夜 Dream 回顾
en: Last Night's Dream Recap
ja: 昨夜の Dream レビュー
ko: 지난밤 Dream 회고
zh_hant: 昨夜 Dream 回顧

# dream_section_time_window
source: 时间窗
en: Time Window
ja: 実行時間帯
ko: 시간대
zh_hant: 時間窗

# dream_window_always
source: 随时
en: Anytime
ja: いつでも
ko: 항상
zh_hant: 隨時

# dream_window_always_sub
source: 只要设备闲置
en: Whenever the device is idle
ja: デバイスがアイドル状態であれば
ko: 기기가 유휴 상태이기만 하면
zh_hant: 只要裝置閒置

# dream_window_custom
source: 自定义时段
en: Custom Window
ja: カスタム時間帯
ko: 사용자 지정 시간대
zh_hant: 自訂時段

# dream_window_custom_sub
source: 设置每日时间窗
en: Set a daily time window
ja: 毎日の実行時間帯を設定
ko: 매일의 시간대를 직접 설정
zh_hant: 設定每日時間窗

# dream_window_night
source: 夜间 (00:00–06:00)
en: Night (00:00–06:00)
ja: 夜間（00:00〜06:00）
ko: 야간 (00:00–06:00)
zh_hant: 夜間 (00:00–06:00)

# dream_window_night_sub
source: 默认，最不打扰
en: Default, least disruptive
ja: デフォルト・最も邪魔になりにくい
ko: 기본값, 가장 방해가 적음
zh_hant: 預設，最不打擾

# local_apps_action_failed_title
source: 应用操作失败
en: App action failed
ja: アプリの操作に失敗しました
ko: 앱 작업 실패
zh_hant: 應用操作失敗

# local_apps_add_a11y
source: 添加
en: Add
ja: 追加
ko: 추가
zh_hant: 新增

# local_apps_add_item_placeholder
source: 添加一项
en: Add an item
ja: 項目を追加
ko: 항목 추가
zh_hant: 新增一項

# local_apps_agent_suggestion
source: Agent 建议
en: Agent Suggestion
ja: Agent の提案
ko: 에이전트 제안
zh_hant: Agent 建議

# local_apps_allow_always
source: 始终允许
en: Always Allow
ja: 常に許可
ko: 항상 허용
zh_hant: 始終允許

# local_apps_allow_once
source: 允许一次
en: Allow Once
ja: 1 回だけ許可
ko: 한 번 허용
zh_hant: 允許一次

# local_apps_allow_session
source: 本次会话允许
en: Allow for This Session
ja: このセッションのみ許可
ko: 이번 세션에서 허용
zh_hant: 本次會話允許

# local_apps_allow_session_short
source: 本次会话
en: This Session
ja: このセッション
ko: 이번 세션
zh_hant: 本次會話

# local_apps_app_deleted_edits_lost
source: 该应用已被删除，尚未保存的设计修改已丢失，已返回应用列表。
en: This app has been deleted; unsaved design changes were lost, and you've been returned to the app library.
ja: このアプリは削除されました。未保存のデザイン変更は失われ、アプリ一覧に戻りました。
ko: 이 앱이 삭제되어 저장하지 않은 디자인 수정 사항을 잃었습니다. 앱 목록으로 돌아갑니다.
zh_hant: 該應用已被刪除，尚未儲存的設計修改已丟失，已返回應用列表。

# local_apps_apply_suggestion
source: 应用建议
en: Apply Suggestion
ja: 提案を適用
ko: 제안 적용
zh_hant: 應用建議

# local_apps_approve_preview
source: 批准预览
en: Approve Preview
ja: プレビューを承認
ko: 미리보기 승인
zh_hant: 批准預覽

# local_apps_authorization_app_id
source: 应用：%1$s
en: App: %1$s
ja: アプリ：%1$s
ko: 앱: %1$s
zh_hant: 應用：%1$s

# local_apps_authorization_queue_overflow
source: 应用的授权请求过多，已忽略最新一条
en: Too many authorization requests from the app; the latest one was ignored
ja: アプリからの許可リクエストが多すぎるため、最新の 1 件を無視しました
ko: 앱의 권한 요청이 너무 많아 최신 요청이 무시되었습니다
zh_hant: 應用的授權請求過多，已忽略最新一條

# local_apps_awaiting_generation_job
source: 正在等待生成任务…
en: Waiting for the generation job…
ja: 生成タスクを待っています…
ko: 생성 작업을 기다리는 중…
zh_hant: 正在等待生成任務…

# local_apps_browser_error_not_editable
source: 该文件不是可编辑的 UTF-8 源码。
en: This file isn't editable UTF-8 source code.
ja: このファイルは編集可能な UTF-8 ソースコードではありません。
ko: 이 파일은 편집 가능한 UTF-8 소스 코드가 아닙니다.
zh_hant: 該檔案不是可編輯的 UTF-8 原始碼。

# local_apps_browser_error_path_escaped
source: 已拒绝工作区之外的路径。
en: Paths outside the workspace aren't allowed.
ja: ワークスペース外のパスは拒否されました。
ko: 작업 공간 밖의 경로는 거부되었습니다.
zh_hant: 已拒絕工作區之外的路徑。

# local_apps_browser_error_source_absolute
source: 已拒绝绝对源码路径。
en: Absolute source paths are rejected.
ja: 絶対パスのソースコードは拒否されました。
ko: 절대 경로의 소스 코드는 거부되었습니다.
zh_hant: 已拒絕絕對原始碼路徑。

# local_apps_browser_error_too_large
source: 单个可编辑源码文件不能超过 1 MiB。
en: A single editable source file can't exceed 1 MiB.
ja: 編集可能なソースファイルは 1 つあたり 1 MiB を超えることはできません。
ko: 편집 가능한 소스 코드 파일 하나는 1 MiB를 초과할 수 없습니다.
zh_hant: 單個可編輯原始碼檔案不能超過 1 MiB。

# local_apps_browser_error_workspace_absolute
source: 已拒绝绝对工作区路径。
en: Absolute workspace paths are rejected.
ja: 絶対パスのワークスペースは拒否されました。
ko: 절대 경로의 작업 공간은 거부되었습니다.
zh_hant: 已拒絕絕對工作區路徑。

# local_apps_browser_error_workspace_invalid
source: 已拒绝无效工作区路径。
en: Invalid workspace paths are rejected.
ja: 無効なワークスペースパスは拒否されました。
ko: 잘못된 작업 공간 경로는 거부되었습니다.
zh_hant: 已拒絕無效工作區路徑。

# local_apps_capability_domain_suffix
source: 域名：%1$s
en: Domain: %1$s
ja: ドメイン：%1$s
ko: 도메인: %1$s

# local_apps_capability_section_detail
source: 首次修改数据、控制 UI 或访问声明域名时，系统会提供允许一次、本次会话或始终允许。未授权请求默认拒绝。
en: The first time the app modifies data, controls the UI, or accesses a declared domain, you'll be offered allow once, allow this session, or always allow. Unauthorized requests are denied by default.
ja: 初めてデータを変更したり、UI を操作したり、宣言済みのドメインにアクセスする際、システムは「1 回だけ許可」「このセッションのみ許可」「常に許可」を提示します。許可されていないリクエストはデフォルトで拒否されます。
ko: 데이터를 처음 수정하거나 UI를 제어하거나 명시된 도메인에 접근할 때, 한 번 허용 · 이번 세션 · 항상 허용 중에서 선택할 수 있습니다. 권한이 없는 요청은 기본적으로 거부됩니다.
zh_hant: 首次修改資料、控制 UI 或存取宣告域名時，系統會提供允許一次、本次會話或始終允許。未授權請求預設拒絕。

# local_apps_capability_section_title
source: 能力授权
en: Capability authorization
ja: 権限
ko: 권한 부여
zh_hant: 能力授權

# local_apps_card_menu_a11y
source: 应用操作
en: App actions
ja: アプリの操作
ko: 앱 작업
zh_hant: 應用操作

# local_apps_checkpoint_restore_action
source: 恢复
en: Restore
ja: 復元
ko: 복원
zh_hant: 恢復

# local_apps_confirm_generate
source: 确认并生成
en: Confirm & Generate
ja: 確認して生成
ko: 확인하고 생성
zh_hant: 確認並生成

# local_apps_confirming
source: 确认中…
en: Confirming…
ja: 確認中…
ko: 확인하는 중…
zh_hant: 確認中…

# local_apps_continue_design
source: 继续设计
en: Continue Designing
ja: デザインを続ける
ko: 디자인 계속하기
zh_hant: 繼續設計

# local_apps_create
source: 创建应用
en: Create App
ja: アプリを作成
ko: 앱 만들기
zh_hant: 建立應用

# local_apps_create_and_design
source: 创建并开始设计
en: Create and start designing
ja: 作成してデザインを開始
ko: 만들고 디자인 시작
zh_hant: 建立並開始設計

# local_apps_create_detail
source: 创建后进入五步设计向导。生成只有在你确认设计后才会开始。
en: After creating, you'll go through a five-step design wizard. Generation only starts once you confirm the design.
ja: 作成すると、5 ステップのデザインウィザードに進みます。デザインを確認するまで生成は開始されません。
ko: 생성 후 5단계 디자인 마법사로 진입합니다. 생성은 디자인을 확인한 후에만 시작됩니다.
zh_hant: 建立後進入五步設計嚮導。生成只有在你確認設計後才會開始。

# local_apps_create_name_hint
source: 稍后可在设计器中继续完善用途和目标用户。
en: You can keep refining the purpose and target users later in the designer.
ja: 用途や対象ユーザーは、後でデザイナー内に引き続き詳しく設定できます。
ko: 용도와 대상 사용자는 나중에 디자이너에서 계속 다듬을 수 있습니다.
zh_hant: 稍後可在設計器中繼續完善用途和目標使用者。

# local_apps_creating
source: 创建中…
en: Creating…
ja: 作成中…
ko: 만드는 중…
zh_hant: 建立中…

# local_apps_current_step
source: 当前步骤
en: Current Step
ja: 現在のステップ
ko: 현재 단계
zh_hant: 當前步驟

# local_apps_data_field_name
source: 字段名称
en: Field name
ja: フィールド名
ko: 필드 이름
zh_hant: 欄位名稱

# local_apps_data_field_type_boolean
source: 布尔
en: Boolean
ja: 真偽値
ko: 불리언
zh_hant: 布林

# local_apps_data_field_type_datetime
source: 日期时间
en: Date & time
ja: 日時
ko: 날짜/시간
zh_hant: 日期時間

# local_apps_data_field_type_decimal
source: 小数
en: Decimal
ko: 소수
zh_hant: 小數

# local_apps_data_field_type_enum
source: 枚举
en: Enum
ja: 列挙型
ko: 열거형
zh_hant: 列舉

# local_apps_data_field_type_image_ref
source: 图片引用
en: Image reference
ja: 画像参照
ko: 이미지 참조
zh_hant: 圖片引用

# local_apps_data_field_type_integer
source: 整数
en: Integer
ko: 정수
zh_hant: 整數

# local_apps_data_field_type_long_text
source: 长文本
en: Long text
ja: 長文テキスト
ko: 긴 텍스트
zh_hant: 長文字

# local_apps_data_field_type_text
source: 文本
en: Text
ja: テキスト
ko: 텍스트
zh_hant: 文字

# local_apps_data_section_detail
source: SQLite 由 Rust AppService 独占管理。页面与 Agent 只能使用 collection API；原始 SQL 不会暴露。
en: SQLite is exclusively managed by the Rust AppService. Pages and the Agent can only use the collection API; raw SQL is never exposed.
ja: SQLite は Rust AppService が単独で管理します。ページと Agent は collection API のみを使用でき、生の SQL は公開されません。
ko: SQLite는 Rust AppService가 독점적으로 관리합니다. 페이지와 에이전트는 collection API만 사용할 수 있으며, 원시 SQL은 노출되지 않습니다.
zh_hant: SQLite 由 Rust AppService 獨佔管理。頁面與 Agent 只能使用 collection API；原始 SQL 不會暴露。

# local_apps_data_section_title
source: 受控本地数据
en: Managed local data
ja: 制御されたローカルデータ
ko: 제어된 로컬 데이터
zh_hant: 受控本地資料

# local_apps_data_sqlite
source: SQLite 由 Rust AppService 独占管理
en: SQLite is managed exclusively by the Rust AppService
ja: SQLite は Rust AppService が単独で管理します
ko: SQLite는 Rust AppService가 독점적으로 관리합니다
zh_hant: SQLite 由 Rust AppService 獨佔管理

# local_apps_data_sqlite_detail
source: 页面和 Agent 只能通过受控 collection API 查询和修改，不接受原始 SQL。
en: Pages and agents can only query and modify data through the controlled collection API — raw SQL isn't accepted.
ja: ページと Agent は制御された collection API を通じてのみ照会・変更ができ、生の SQL は受け付けません。
ko: 페이지와 에이전트는 제어된 collection API로만 조회하고 수정할 수 있으며, 원시 SQL은 허용되지 않습니다.
zh_hant: 頁面和 Agent 只能透過受控 collection API 查詢和修改，不接受原始 SQL。

# local_apps_delete
source: 删除应用
en: Delete App
ja: アプリを削除
ko: 앱 삭제
zh_hant: 刪除應用

# local_apps_delete_confirm
source: 删除 %1$s？
en: Delete %1$s?
ja: %1$s を削除しますか？
ko: %1$s을(를) 삭제하시겠습니까?
zh_hant: 刪除 %1$s？

# local_apps_delete_confirm %@
source: 删除 %@？
en: Delete %@?
ja: %@ を削除しますか？
ko: %@을(를) 삭제하시겠습니까?
zh_hant: 刪除 %@？

# local_apps_delete_confirm_detail
source: 代码、构建产物、日志和本地 SQLite 数据都会永久删除。
en: Code, build artifacts, logs, and local SQLite data will all be permanently deleted.
ja: コード、ビルド成果物、ログ、ローカルの SQLite データはすべて完全に削除されます。
ko: 코드, 빌드 결과물, 로그, 로컬 SQLite 데이터가 모두 영구적으로 삭제됩니다.
zh_hant: 程式碼、建置產物、日誌和本地 SQLite 資料都會永久刪除。

# local_apps_delete_detail
source: 代码、构建产物和该应用的本地数据将被删除。
en: This deletes the code, build artifacts, and local data for this app.
ja: コード、ビルド成果物、このアプリのローカルデータが削除されます。
ko: 코드, 빌드 결과물, 이 앱의 로컬 데이터가 삭제됩니다.
zh_hant: 程式碼、建置產物和該應用的本地資料將被刪除。

# local_apps_delete_item_a11y
source: 删除 %1$s
en: Delete %1$s
ja: %1$s を削除
ko: %1$s 삭제
zh_hant: 刪除 %1$s

# local_apps_deny
source: 拒绝
en: Deny
ja: 拒否
ko: 거부
zh_hant: 拒絕

# local_apps_design_conflict_reloaded
source: 设计已在其他位置更新到版本 %1$s，已重新加载，请检查后继续。
en: The design was updated elsewhere to version %1$s; it has been reloaded — please review before continuing.
ja: デザインは他の場所でバージョン %1$s に更新されました。再読み込みしましたので、確認してから続行してください。
ko: 디자인이 다른 곳에서 버전 %1$s로 업데이트되어 다시 로드했습니다. 확인 후 계속 진행해 주세요.
zh_hant: 設計已在其他位置更新到版本 %1$s，已重新載入，請檢查後繼續。

# local_apps_design_unsaved_retry
source: 设计尚未保存完成，请重试
en: The design hasn't finished saving yet; please try again
ja: デザインの保存が完了していません。もう一度お試しください
ko: 디자인이 아직 저장되지 않았습니다. 다시 시도해 주세요
zh_hant: 設計尚未儲存完成，請重試

# local_apps_designer_not_ready
source: 设计器尚未准备好
en: Designer isn't ready yet
ja: デザイナーはまだ準備できていません
ko: 디자이너가 아직 준비되지 않았습니다
zh_hant: 設計器尚未準備好

# local_apps_designer_opening
source: 正在打开设计会话。
en: Opening design session.
ja: デザインセッションを開いています。
ko: 디자인 세션을 여는 중입니다.
zh_hant: 正在開啟設計會話。

# local_apps_designer_step %lld %@
source: 第 %lld 步：%@
en: Step %lld: %@
ja: ステップ %lld：%@
ko: %lld단계: %@

# local_apps_designer_title
source: 应用设计
en: App Designer
ja: アプリデザイン
ko: 앱 디자인
zh_hant: 應用設計

# local_apps_designer_waiting
source: 正在等待 Rust 模板和应用详情。
en: Waiting for the Rust template and app details.
ja: Rust テンプレートとアプリの詳細を待っています。
ko: Rust 템플릿과 앱 세부 정보를 기다리는 중입니다.
zh_hant: 正在等待 Rust 模板和應用詳情。

# local_apps_detail_title
source: 应用详情
en: App Details
ja: アプリの詳細
ko: 앱 세부 정보
zh_hant: 應用詳情

# local_apps_domain
source: 域名
en: Domain
ja: ドメイン
ko: 도메인

# local_apps_empty
source: 还没有本地应用
en: No local apps yet
ja: ローカルアプリはまだありません
ko: 아직 로컬 앱이 없습니다
zh_hant: 還沒有本地應用

# local_apps_empty_detail
source: 从模板开始，Agent 会在确认设计后生成应用。
en: Start from a template — the agent will generate your app once you confirm the design.
ja: テンプレートから始めましょう。デザインを確認すると Agent がアプリを生成します。
ko: 템플릿으로 시작하면 디자인을 확인한 후 에이전트가 앱을 생성합니다.
zh_hant: 從模板開始，Agent 會在確認設計後生成應用。

# local_apps_empty_hint
source: 从模板开始设计，Agent 会在确认后生成应用。
en: Start designing from a template — the agent generates the app once you confirm.
ja: テンプレートからデザインを始めましょう。確認後、Agent がアプリを生成します。
ko: 템플릿으로 디자인을 시작하면 확인 후 에이전트가 앱을 생성합니다.
zh_hant: 從模板開始設計，Agent 會在確認後生成應用。

# local_apps_empty_loading
source: 正在读取应用库…
en: Loading your apps…
ja: アプリライブラリを読み込み中…
ko: 앱 라이브러리를 불러오는 중…
zh_hant: 正在讀取應用庫…

# local_apps_error_bridge_failed
source: Bridge 请求失败。
en: Bridge request failed.
ja: Bridge リクエストが失敗しました。
ko: Bridge 요청에 실패했습니다.
zh_hant: Bridge 請求失敗。

# local_apps_error_bridge_invalid_json
source: Bridge 返回了无效 JSON。
en: Bridge returned invalid JSON.
ja: Bridge が無効な JSON を返しました。
ko: Bridge가 잘못된 JSON을 반환했습니다.
zh_hant: Bridge 返回了無效 JSON。

# local_apps_error_bridge_rejected
source: 本地应用引擎未接受 Bridge 请求。
en: The local app engine rejected the bridge request.
ja: ローカルアプリエンジンが Bridge リクエストを受け付けませんでした。
ko: 로컬 앱 엔진이 Bridge 요청을 거부했습니다.
zh_hant: 本地應用引擎未接受 Bridge 請求。

# local_apps_error_bridge_unsupported
source: 不支持的 Lingxi Bridge 操作。
en: Unsupported Lingxi Bridge operation.
ja: サポートされていない Lingxi Bridge 操作です。
ko: 지원되지 않는 Lingxi Bridge 작업입니다.
zh_hant: 不支援的 Lingxi Bridge 操作。

# local_apps_error_bridge_unsupported_op
source: 应用请求了不支持的 Bridge 操作：%1$s
en: The app requested an unsupported Bridge operation: %1$s
ja: アプリが未対応の Bridge 操作を要求しました：%1$s
ko: 앱이 지원되지 않는 Bridge 작업을 요청했습니다: %1$s
zh_hant: 應用請求了不支援的 Bridge 操作：%1$s

# local_apps_error_design_conflict
source: 设计已在其他位置更新，正在基于最新版本重试。
en: The design was updated elsewhere — retrying with the latest version.
ja: デザインは他の場所で更新されています。最新バージョンで再試行しています。
ko: 디자인이 다른 곳에서 업데이트되어 최신 버전을 기준으로 다시 시도하고 있습니다.
zh_hant: 設計已在其他位置更新，正在基於最新版本重試。

# local_apps_error_design_loading
source: 请等待应用设计详情加载完成。
en: Please wait for the app design details to finish loading.
ja: アプリのデザイン詳細の読み込みが完了するまでお待ちください。
ko: 앱 디자인 세부 정보가 로드될 때까지 기다려 주세요.
zh_hant: 請等待應用設計詳情載入完成。

# local_apps_error_design_not_ready
source: 设计确认请求尚未准备好。
en: The design confirmation request isn't ready yet.
ja: デザイン確認リクエストはまだ準備できていません。
ko: 디자인 확인 요청이 아직 준비되지 않았습니다.
zh_hant: 設計確認請求尚未準備好。

# local_apps_error_design_unsaved
source: 设计尚未保存完成，请重试。
en: The design hasn't finished saving — please try again.
ja: デザインの保存が完了していません。もう一度お試しください。
ko: 디자인이 아직 저장되지 않았습니다. 다시 시도해 주세요.
zh_hant: 設計尚未儲存完成，請重試。

# local_apps_error_engine_not_connected
source: 本地应用引擎尚未连接。
en: The local app engine isn't connected yet.
ja: ローカルアプリエンジンはまだ接続されていません。
ko: 로컬 앱 엔진이 아직 연결되지 않았습니다.
zh_hant: 本地應用引擎尚未連線。

# local_apps_error_engine_unavailable
source: 此构建未包含本地应用引擎。
en: This build doesn't include the local app engine.
ja: このビルドにはローカルアプリエンジンが含まれていません。
ko: 이 빌드에는 로컬 앱 엔진이 포함되어 있지 않습니다.
zh_hant: 此建置未包含本地應用引擎。

# local_apps_error_feedback_required
source: 请输入要修改的内容。
en: Please enter what you'd like to change.
ja: 修正したい内容を入力してください。
ko: 수정할 내용을 입력해 주세요.
zh_hant: 請輸入要修改的內容。

# local_apps_error_field_unsupported %@
source: 当前引擎尚未支持字段 %@ 的结构化值。
en: The current engine doesn't yet support structured values for field %@.
ja: 現在のエンジンはフィールド %@ の構造化値にまだ対応していません。
ko: 현재 엔진은 %@ 필드의 구조화된 값을 아직 지원하지 않습니다.
zh_hant: 當前引擎尚未支援欄位 %@ 的結構化值。

# local_apps_error_load_apps
source: 无法加载应用：%1$s
en: Couldn't load apps: %1$s
ja: アプリを読み込めません：%1$s
ko: 앱을 불러올 수 없습니다: %1$s
zh_hant: 無法載入應用：%1$s

# local_apps_error_load_templates
source: 无法加载应用模板：%1$s
en: Couldn't load app templates: %1$s
ja: アプリテンプレートを読み込めません：%1$s
ko: 앱 템플릿을 불러올 수 없습니다: %1$s
zh_hant: 無法載入應用模板：%1$s

# local_apps_error_name_required
source: 请输入应用名称。
en: Please enter an app name.
ja: アプリ名を入力してください。
ko: 앱 이름을 입력해 주세요.
zh_hant: 請輸入應用名稱。

# local_apps_error_permission_overflow
source: 应用同时请求了过多授权，已忽略最新的请求。
en: The app requested too many permissions at once — the latest request was ignored.
ja: アプリが同時に多くの権限を要求したため、最新のリクエストは無視されました。
ko: 앱이 한 번에 너무 많은 권한을 요청하여 최신 요청이 무시되었습니다.
zh_hant: 應用同時請求了過多授權，已忽略最新的請求。

# local_apps_error_preview_not_ready
source: 预览确认请求尚未准备好。
en: The preview confirmation request isn't ready yet.
ja: プレビュー確認リクエストはまだ準備できていません。
ko: 미리보기 확인 요청이 아직 준비되지 않았습니다.
zh_hant: 預覽確認請求尚未準備好。

# local_apps_error_title
source: 应用错误
en: App Error
ja: アプリエラー
ko: 앱 오류
zh_hant: 應用錯誤

# local_apps_error_ui_appid_mismatch
source: 界面操作的应用标识不匹配。
en: The app ID for this UI action doesn't match.
ja: UI 操作のアプリ ID が一致しません。
ko: 화면 조작의 앱 식별자가 일치하지 않습니다.
zh_hant: 介面操作的應用標識不匹配。

# local_apps_error_ui_closed
source: 应用页面已关闭。
en: The app page has been closed.
ja: アプリページは閉じられました。
ko: 앱 화면이 닫혔습니다.
zh_hant: 應用頁面已關閉。

# local_apps_error_ui_encode_failed
source: 界面操作参数无法编码。
en: Couldn't encode the UI action parameters.
ja: UI 操作のパラメーターをエンコードできませんでした。
ko: 화면 조작 매개변수를 인코딩할 수 없습니다.
zh_hant: 介面操作引數無法編碼。

# local_apps_error_ui_invalid_result
source: 界面操作未返回有效结果。
en: The UI action didn't return a valid result.
ja: UI 操作から有効な結果が返されませんでした。
ko: 화면 조작이 유효한 결과를 반환하지 않았습니다.
zh_hant: 介面操作未返回有效結果。

# local_apps_error_ui_no_history
source: 应用页面没有可返回的历史记录。
en: The app page has no history to go back to.
ja: アプリページには戻れる履歴がありません。
ko: 앱 화면에 돌아갈 이력이 없습니다.
zh_hant: 應用頁面沒有可返回的歷史記錄。

# local_apps_error_ui_not_open
source: 应用页面尚未打开，无法执行界面操作。
en: The app page isn't open, so this UI action can't run.
ja: アプリページが開かれていないため、UI 操作を実行できません。
ko: 앱 화면이 아직 열리지 않아 화면 조작을 실행할 수 없습니다.
zh_hant: 應用頁面尚未開啟，無法執行介面操作。

# local_apps_error_ui_rejected
source: 用户拒绝了界面操作。
en: The user declined the UI action.
ja: ユーザーが UI 操作を拒否しました。
ko: 사용자가 화면 조작을 거부했습니다.
zh_hant: 使用者拒絕了介面操作。

# local_apps_error_ui_result_encode
source: 界面操作结果无法编码。
en: Couldn't encode the UI action result.
ja: UI 操作の結果をエンコードできませんでした。
ko: 화면 조작 결과를 인코딩할 수 없습니다.
zh_hant: 介面操作結果無法編碼。

# local_apps_external_link_title
source: 在系统浏览器打开外部链接？
en: Open external link in your browser?
ja: システムのブラウザで外部リンクを開きますか？
ko: 시스템 브라우저에서 외부 링크를 여시겠습니까?
zh_hant: 在系統瀏覽器開啟外部連結？

# local_apps_feedback
source: 反馈修改
en: Request Changes
ja: 修正のフィードバック
ko: 수정 피드백
zh_hant: 反饋修改

# local_apps_field_add
source: 添加数据字段
en: Add Data Field
ja: データフィールドを追加
ko: 데이터 필드 추가
zh_hant: 新增資料欄位

# local_apps_field_delete
source: 删除字段
en: Delete Field
ja: フィールドを削除
ko: 필드 삭제
zh_hant: 刪除欄位

# local_apps_field_enabled
source: 已启用
en: Enabled
ja: 有効
ko: 활성화됨
zh_hant: 已啟用

# local_apps_field_name
source: 字段名
en: Field Name
ja: フィールド名
ko: 필드 이름
zh_hant: 欄位名

# local_apps_field_required
source: 必填
en: Required
ja: 必須
ko: 필수

# local_apps_field_type
source: 类型
en: Type
ja: 種類
ko: 유형
zh_hant: 型別
